cavisson/default/default/scripts/bhPostXml/soap.txt

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
    <env:Body env:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
	<m:execute xmlns:m="urn:tracker">
	    <requestName xsi:type="xsd:string">updateLog</requestName>
	    <xmlParameter xsi:type="xsd:string">&lt;UpdateAuthResultRequest&gt;&lt;requestId&gt;{UUID}&lt;/requestId&gt;&lt;userId&gt;{Uname}&lt;/userId&gt;&lt;loginId&gt;{Uname}&lt;/loginId&gt;&lt;isSecure&gt;true&lt;/isSecure&gt;&lt;groupId&gt;1&lt;/groupId&gt;&lt;result&gt;0&lt;/result&gt;&lt;secureCookie&gt;{CID1}&lt;/secureCookie&gt;&lt;digitalCookie&gt;{CID2}&lt;/digitalCookie&gt;&lt;clientType&gt;8&lt;/clientType&gt;&lt;clientVersion&gt;normal1.0&lt;/clientVersion&gt;&lt;remoteIPAddr&gt;{IPaddr}&lt;/remoteIPAddr&gt;&lt;remoteHost&gt;{IPaddr}&lt;/remoteHost&gt;&lt;fingerPrintType&gt;1&lt;/fingerPrintType&gt;&lt;fingerPrint&gt;userAgent#^#Mozilla/5.0 (Windows; U; Windows NT 5.1; en-US; rv:1.7.10) Gecko/20050716 Firefox/1.0.6#^#requestMethod#^#GET#^#requestUrlPath#^#/host/dc#^#connectScheme#^#https#^#isSecureConnection#^#1#^#localLang#^#en#^#localCountry#^#US&lt;/fingerPrint&gt;&lt;fingerPrintType2&gt;2&lt;/fingerPrintType2&gt;&lt;fingerPrint2&gt;A#^#t#^#ACC#^#t#^#AE#^#t#^#AR#^#1.0#^#AVD#^#f#^#COL#^#color#^#DEB#^#f#^#DP#^#72#^#EV#^#t#^#L#^#en#^#LFD#^#f#^#M#^#Macromedia Windows#^#MP3#^#t#^#OS#^#Windows XP#^#PR#^#t#^#PT#^#ActiveX#^#R#^#1400x1050#^#SA#^#t#^#SB#^#f#^#SP#^#t#^#SV#^#t#^#V#^#WIN 7,0,19,0#^#VE#^#t#^#WD#^#f&lt;/fingerPrint2&gt;&lt;/UpdateAuthResultRequest&gt;</xmlParameter></m:execute></env:Body></env:Envelope>
 
